app/controllers/maps_controller.rb

  def show
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"