app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @topic = Topic.find(params[:id])

SELECT "topics".* FROM "topics" ORDER BY votes desc
---
  def display
    @topics = Topic.all

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "topics" SET "weight" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["weight", 0.41000001144409154], ["updated_at", 2017-04-09 07:03:11 UTC], ["id", 5]]
---
  def update
    @descontento = Topic.find(params[:id])
    @descontento.votes += 1000
    @descontento.save