app/controllers/twitter_controller.rb

SELECT "topics".* FROM "topics"
---
  def weighting
    require 'twitter'
    require 'googleauth'
    require "google/cloud/language"

    client = Twitter::REST::Client.new do |config|
      config.consumer_key        = "ukRaD39TUQgwSGd3lFhV9PNxC"
      config.consumer_secret     = "2XM5sij4i7vJoPUfHahKGZnRLHFb9cc326yNYYuPmhJTQitaB4"
      config.access_token        = "2577942758-oXKaHshrBWS6xR9NgwDGMUh03VF4J3eRwlHUD2J"
      config.access_token_secret = "jewinSdaF1y7ynaw44CL5jQ7GRcgcMiA5Rre7G5M8fpaX"
    end

    scopes =  ['https://www.googleapis.com/auth/cloud-platform','https://www.googleapis.com/auth/cloud-platform.read-only']
    authorization = Google::Auth.get_application_default(scopes)

    @dislikes = Topic.all