app/controllers/votes_controller.rb

SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @vote = Vote.find(params[:id])

SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_vote
      @vote = Vote.find(params[:id])