app/views/votes/index.html.erb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	<%@votes.each do |vote|%>
		<% descript = User.find(vote.user_id).name + " voted for " + Topic.find(vote.topic_id).name %>